# Задача 6

## Условие

Определите сумму всех элементов последовательности, завершающейся числом 0.

## Формат входных данных

Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, а служит как признак ее окончания.

## Формат выходных данных

Выведите ответ на задачу.

## Sample Input

3
6
8
0

## Sample Output

17

``` cpp
#include <iostream>

int main() {
  int n, summ = 0;
  std::cin >> n;

  while (n != 0) {
    summ += n;
    std::cin >> n;
  }

  std::cout << summ;

  return 0;
}
```
