# Задача 2

## Условие

Дано целое число, не меньшее 2. Выведите его наименьший натуральный делитель, отличный от 1.

## Формат входных данных

Вводится целое положительное число.

## Формат выходных данных

Выведите ответ на задачу.

## Sample Input:

15

## Sample Output:

3

``` cpp
#include <iostream>

int main() {
  int a, i = 2;
  std::cin >> a;
  while ((a % i) != 0) {
    i++;
  }
  std::cout << i;
  return 0;
}
```