# Задача 10

## Условие

Шахматный конь ходит буквой “Г” — на две клетки по вертикали в любом направлении и на одну клетку по горизонтали, или наоборот. Даны две различные клетки шахматной доски, определите, может ли конь попасть с первой клетки на вторую одним ходом. 

## Формат входных данных:

Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.

## Формат выходных данных

Программа должна вывести YES, если из первой клетки ходом ферзя можно попасть во вторую или NO в противном случае.

## Sample Input 1:

1

1

1

4

## Sample Output 1:

NO

## Sample Input 2:

1

1

8

8

## Sample Output 2:

NO

``` cpp
#include <iostream>

int main() {
 int col1, row1, col2, row2;
    std::cin >> col1 >> row1 >> col2 >> row2;
    if (((abs(col2 - col1)*2) == abs(row2 - row1)) || ((abs(row2 - row1)*2) == abs(col2 - col1))) {
        std::cout << "YES";
    } else {
        std::cout << "NO";
    }
  return 0;
}
```
