# Задача 6

## Условие

Шахматная ладья ходит по горизонтали или вертикали. Даны две различные клетки шахматной доски, определите, может ли ладья попасть с первой клетки на вторую одним ходом.

## Формат входных данных:

Программа получает на вход четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки.

## Формат выходных данных

Программа должна вывести YES, если из первой клетки ходом ладьи можно попасть во вторую или NO в противном случае.

## Sample Input:

4

4

5

5

## Sample Output:

NO

``` cpp
#include <iostream>

int main() {
  int column1, row1, column2, row2;
    std::cin >> column1 >> row1 >> column2 >> row2;
    
    if ((column1 <= 8) && (column1 >=1) && (column2 <= 8) && (column2 >=1) && (row1 <= 8) && (row1 >=1) && (row2 <= 8) && (row2 >=1)) {
        if ((row1 == row2) || (column1 == column2)) {
             std::cout << "YES";
        } else {
            std::cout << "NO";
         }
    } else {
        std::cout << "NO";
    }
  return 0;
}
```
