# Задача 1

## Условие

По данному целому числу N распечатайте все квадраты натуральных чисел, не превосходящие N, в порядке возрастания.

## Формат входных данных

Вводится натуральное число.

## Формат выходных данных

Выведите ответ на задачу.

## Sample Input:

50

## Sample Output:

1 4 9 16 25 36 49

``` cpp
#include <iostream>

int main() {
  int a,b;
	std::cin >> a;
	b = 1;
	while(b * b <= a){
		std::cout << b * b << " ";
		b++;
	}
	return 0;
}
```