# Задача 7

## Условие

Последовательность состоит из натуральных чисел и завершается числом 0. Определите значение наибольшего элемента последовательности.

## Формат входных данных

Вводится последовательность целых чисел, оканчивающаяся числом 0 (само число 0 в последовательность не входит, а служит как признак ее окончания).

## Формат выходных данных

Выведите ответ на задачу.

## Sample Input

1
7
9
0

## Sample Output

9

``` cpp
#include <iostream>

int main() {
  int n, temp;
  std::cin >> n;
  temp = n;

  while (n != 0) {
    std::cin >> n;
    if (n > temp) {
      temp = n;
    }
  }

  std::cout << temp;

  return 0;
}
```
